[
  "JMAX MEDIA is a full service video production and graphic design company based in the UK and China. We specialise in creating original branding solutions that resonate and engage with an international audience.",
  "SERVICES",
  "VIDEO PRODUCTION & PHOTOGRAPHY",
  "We specialize in developing an initial concept, through storyboarding, filming, editing and post-production to delivery with a digital marketing support package.",
  "Film",
  "Animation",
  "Aerial Footage",
  "Commercial",
  "Personal",
  "Corporate Video",
  "CHINESE MARKET ENTRY STRATEGY",
  "The challenge of China market entry has become an increasingly important one of Western companies of all shapes and sizes. Are you still struggling to get into the Chinese market? We provide efficient solutions to eliminate the cultural barrier and language difficulty.",
  "Cultural Adaptation",
  "Social Media Management",
  "Government Policies and Regulations",
  "BRANDING",
  "One of the best ways to give your business an edge is to give it a consistent look, from your business cards to your website to your advertising materials. We can build your brand from scratch or give your existing brand a facelift. Effective social media success takes effective planning and creative thinking to drive customers to know you.",
  "Graphic Design",
  "Online Marketing Strategy",
  "Advertising",
  "Web Design",
  "Marketing Campaign",
  "our work",
  "JMAX MEDIA is a full service video production and graphic design company based in the UK and China. We specialise in creating original branding solutions that resonate and engage with an international audience.",
  "We can design or reimagine your brand, from a logo and colour scheme to company stationary and social media presence, in collaboration with our video production and promotion services.",
  "For every video we develop an initial concept, through storyboarding, filming, editing and post-production to delivery with a digital marketing support package.",
  "We take our time to get to know you, your brand and what you hope to achieve. Whether you’re just starting out or are a household name, we can tailor our services to suit your specification and budget.",
  "There is no better promotion than by word of mouth. We work with you to fully understand your target market, and use unique strategies to boost your company’s presence on social media and beyond.",
  "We look forward to working with you soon.",
  "our team",
  "We have a complete in-house team bursting with creativity, enthusiasm and a strong motivation to achieve the best possible end product. We are versatile, adaptable and understanding, and treat every project as if it were our own.",
  "Each member of the team has a wealth of experience in their chosen fields and valuable industry connections unrivalled by others. We work with fantastic British and Chinese companies involved in DITS, film production and post-production, distribution, international sales and investment. This relationship differentiates JMAX MEDIA from its competitors, with the ability to provide additional services that other creative companies cannot. Our studio in Brighton also has its own camera crew and post production suite.",
  "We are fast, reliable and always looking for ways to improve the efficiency of our workflow. We believe that the best way to maximise the success of your project is close collaboration and to fine-tune every detail, with the bigger picture firmly in mind.",
  "links",
  "contact",
  "home",
  "clients",
  "get in touch now",
  "follow us",
  "address",
  "get in touch",
  "email",
  "phone",
  "LET'S WORK WITH OUR AWARD WINNING TEAM",
  "WE CAN TAILOR A SOLUTION TO MEET YOUR NEEDS",
  "VIEW PROJECT",
  "Let's see what they said about us",
  "A bit of light hearted Friday fun and industy insight from the team at Casual Towers!"
]
